[AlphaRifleman X2SoldierClassTemplate]
+DisplayName="先锋"
+ClassSummary="先锋是Xcom的重要组成部分，通常是第一个投入战斗的人。先锋擅长中近距离作战，并坚守阵地对抗敌人。"
+LeftAbilityTreeTitle="守望者"
+RightAbilityTreeTitle="突击者"
+AbilityTreeTitles[0]="守望者"
+AbilityTreeTitles[1]="突击者"
+AbilityTreeTitles[2]="游骑兵"
+AbilityTreeTitles[3]="XCOM"


;NICKNAMES
+RandomNickNames[0]="The Wall"
+RandomNickNames[1]="Delta"
+RandomNickNames[2]="Pointman"
+RandomNickNames[3]="Marksman"
+RandomNickNames[4]="Frosty"
+RandomNickNames[5]="Lookout"
+RandomNickNames[6]="Warden"
+RandomNickNames[7]="Eagle-Eyes"
+RandomNickNames[8]="Take Down"
+RandomNickNames[9]="Tracer"
+RandomNickNames[10]="Alpha"
+RandomNickNames[11]="Bravo"
+RandomNickNames[12]="Charlie"
+RandomNickNames[13]="Echo"
+RandomNickNames[14]="Hammer"
+RandomNickNames[15]="Central"
+RandomNickNames[16]="Roller"
+RandomNickNames[17]="Beanbag"
+RandomNickNames[18]="Clutch"
+RandomNickNames[19]="Foxtrot"
+RandomNickNames[20]="Grunt"
+RandomNickNames[21]="Gamma"
+RandomNickNames[22]="Omega"
+RandomNickNames[23]="Kilo"
+RandomNickNames[24]="Shrapnel"
+RandomNickNames[25]="Blitz"
+RandomNickNames[26]="Whiskey"
+RandomNickNames[27]="Sierra"
+RandomNickNames[28]="Tango"
+RandomNickNames[29]="Zulu"

;Abilities Custom

[AROverkill X2AbilityTemplate]
LocFriendlyName="坚守阵地"
LocLongDescription="该单位警戒时，90%概率对所有敌人进行反应射击直到耗尽弹夹或射击失准"
LocHelpText="该单位警戒时，90%概率对所有敌人进行反应射击直到耗尽弹夹或射击失准"
LocFlyOverText="坚守阵地"
LocPromotionPopupText="<Bullet/>该单位警戒时，90%概率对所有敌人进行反应射击直到耗尽弹夹或射击失准<br/>"

[AR_Sprint X2AbilityTemplate]
LocFriendlyName="耐力"
LocLongDescription="让你跑的更远。迅捷动作，+4移动力。CD 2"
LocHelpText="让你跑的更远。迅捷动作，+4移动力。CD 2"
LocFlyOverText="耐力"
LocPromotionPopupText="<Bullet/>让你跑的更远。迅捷动作，+4移动力。<br/> <Bullet/>CD 2<br/>"

[ARReposition X2AbilityTemplate]
LocFriendlyName="重整旗鼓"
LocLongDescription="你的回合内杀敌使你获得1行动点和移动提升."
LocHelpText="你的回合内杀敌使你获得1行动点和移动提升."
LocFlyOverText="重整旗鼓"
LocPromotionPopupText="<Bullet/>你的回合内杀敌使你获得1行动点和移动提升.<br/>"



[ARHipFire X2AbilityTemplate]
LocFriendlyName="盲射"
LocLongDescription="用主武器对随机目标进行射击. 4CD."
LocHelpText="用主武器对随机目标进行射击. 4CD"
LocFlyOverText="盲射"
LocPromotionPopupText="<Bullet/>用主武器对随机目标进行射击. 4CD<br/>"

[AR_FireSupport X2AbilityTemplate]
LocFriendlyName="射击训练"
LocLongDescription="+2精准，+1HP，+5防御"
LocHelpText="+2精准，+1HP，+5防御."
LocFlyOverText="射击训练"

[AR_Soldier X2AbilityTemplate]
LocFriendlyName="防弹衣"
LocLongDescription="+1护甲+5防御."
LocHelpText="+1护甲+5防御"
LocFlyOverText="防弹衣"
LocPromotionPopupText="<Bullet/>+1护甲+5防御.<br/>"


[AR_FireSupport X2SoldierAbilityUnlockTemplate]
DisplayName="先锋: 射击训练"
Summary="+2精准，+1HP，+5防御."

[F_LickYourWounds X2SoldierAbilityUnlockTemplate]
DisplayName="先锋: 急救"
Summary="下蹲可以恢复生命值，恢复数量有每关上限，同时移除燃烧、腐蚀和中毒."


[ACESteady X2AbilityTemplate]
LocFriendlyName="快瞄"
LocLongDescription="可视范围内每一个敌人使你+2精准，最多+10"
LocHelpText="可视范围内每一个敌人使你+2精准，最多+10"
LocFlyOverText="快瞄"
LocPromotionPopupText="<Bullet/>可视范围内每一个敌人使你+2精准，最多+10.<br/><Bullet/>被动.<br/>"

[ACESteady X2SoldierAbilityUnlockTemplate]
DisplayName="先锋: 快瞄"
Summary="可视范围内每一个敌人使你+2精准，最多+10"

[ARClutchShot X2AbilityTemplate]
LocFriendlyName="直瞄射击"
LocLongDescription="使用手枪进行一次一定命中、额外15暴击率和造成最大伤害的射击。CD 5"
LocHelpText="使用手枪进行一次一定命中、额外15暴击率和造成最大伤害的射击。CD 5"
LocFlyOverText="直瞄射击"
LocPromotionPopupText="<Bullet/> 必然命中。<br/><Bullet/> 额外15暴击率.<br/><Bullet/> 可擦伤敌人.<br/><Bullet/> CD 5.<br/>"

[AR_DeadeyeDamage X2AbilityTemplate]
LocFriendlyName="直瞄射击"
LocFlyOverText="直瞄射击"
LocLongDescription="对直瞄射击的对象造成50%额外伤害."
LocHelpText="对直瞄射击的对象造成50%额外伤害."
LocPromotionPopupText="<Bullet/> 对直瞄射击的对象造成50%额外伤害.<br/>"

[AR_LowProfile X2AbilityTemplate]
LocFriendlyName="低伏"
LocLongDescription="半掩体等效于完全掩体"
LocHelpText="半掩体等效于完全掩体."
LocFlyOverText="L低伏"
LocPromotionPopupText="<Bullet/> 半掩体等效于完全掩体.<br/>"

[CloseCombatSpecialist_GoodXCom X2AbilityTemplate]
LocFriendlyName="肉搏专家"
LocFlyOverText="肉搏专家"
LocLongDescription="在敌人的回合中，对在你四格内开火和移动的所有敌人触发反应射击。"
LocHelpText="在敌人的回合中，对在你四格内开火和移动的所有敌人触发反应射击。."
LocPromotionPopupText="<Bullet/> 如你在隐蔽状态，则不会触发.<br/><Bullet/> 一名敌人一回合只能触发一次."

[CloseCombatSpecialistAttack_GoodXCom X2AbilityTemplate]
LocFriendlyName="肉搏专家"
LocFlyOverText="肉搏专家t"
LocLongDescription="在敌人的回合中，对在你四格内开火和移动的所有敌人触发反应射击。"
LocHelpText="在敌人的回合中，对在你四格内开火和移动的所有敌人触发反应射击。"
LocPromotionPopupText="如你在隐蔽状态，则不会触发.<br/><Bullet/> 一名敌人一回合只能触发一次."

[AR_RunAndGun X2AbilityTemplate]
LocFriendlyName="小兵快跑"
LocFlyOverText="小兵快跑"
LocLongDescription="冲刺后获得一个行动点."
LocHelpText="冲刺后获得一个行动点."
LocPromotionPopupText="<Bullet/> 小兵快跑允许先锋快速拉近距离或占领侧翼。<br/><Bullet/> 3 CD <br/>"

[AR_KillerInstinct X2AbilityTemplate]
LocFriendlyName="杀戮本能"
LocFlyOverText="杀戮本能"
LocLongDescription="小兵快跑激活后，本回合的余下阶段获得50%暴击伤害增益"
LocHelpText="小兵快跑激活后，本回合的余下阶段获得50%暴击伤害增益"
LocPromotionPopupText="<Bullet/> 小兵快跑激活后，本回合的余下阶段获得50%暴击伤害增益.<br/>"

[ARPoisonFire X2AbilityTemplate]
LocFriendlyName="酸蚀弹"
LocLongDescription="先锋装入并打出一发酸蚀弹. CD 5 , 消耗2弹药."
LocHelpText="先锋装入并打出一发酸蚀弹. CD 5 , 消耗2弹药."
LocFlyOverText="酸蚀弹"
LocPromotionPopupText="<Bullet/> 先锋装入并打出一发酸蚀弹. CD 5 , 消耗2弹药.<br/>"

[APLethal X2AbilityTemplate]
LocFriendlyName="王牌手枪"
LocLongDescription="使用手枪时获得10暴击和10准确增益。增益随着武器等级提高。"
LocHelpText="使用手枪时获得10暴击和10准确增益。增益随着武器等级提高。"
LocFlyOverText="Pistol ACE"
LocPromotionPopupText="<Bullet/> 使用手枪时获得10暴击和10准确增益。增益随着武器等级提高。<br/><Bullet/> +10暴击 +10精准. <br/><Bullet/> 被动.<br/>"

[APLethal2 X2AbilityTemplate]
LocFriendlyName="王牌手枪"
LocLongDescription="使用手枪时获得10暴击和10准确增益。增益随着武器等级提高。"
LocHelpText="使用手枪时获得10暴击和10准确增益。增益随着武器等级提高。"
LocFlyOverText="王牌手枪"

[ARGunslinger X2AbilityTemplate]
LocFriendlyName="神枪手"
LocFlyOverText="神枪手"
LocLongDescription="用你的手枪对任何在8格范围内移动或攻击的敌人进行反击"
LocHelpText="允许使用手枪进行警戒射击."
LocPromotionPopupText="<Bullet/> 8范围.<br/><Bullet/> 3 CD.<br/>"

[AR_CloseEncounters X2AbilityTemplate]
LocFriendlyName="短兵相接"
LocFlyOverText="短兵相接"
LocLongDescription="激活小兵快跑后，两回合内+2护甲"
LocHelpText="激活小兵快跑后，两回合内+2护甲"
LocPromotionPopupText="<Bullet/> 激活小兵快跑后，两回合内+2护甲.<br/>"

[ARStreetSweeper2 X2AbilityTemplate]
LocFriendlyName="一网打尽"
LocFlyOverText="一网打尽"
LocLongDescription="锥形武器攻击，对无甲单位造成额外伤害，但可以被完全掩体阻挡。"
LocHelpText="锥形武器攻击，对无甲单位造成额外伤害，但可以被完全掩体阻挡。"
LocPromotionPopupText="<Bullet/> 中范围锥形攻击<br/><Bullet/> 可被完全掩体阻挡。<br/><Bullet/>消耗1行动 2弹药 .<br/><Bullet/> 对范围内无甲目标额外4伤害.<br/><Bullet/> 只能使用步枪和霰弹枪.<br/><Bullet/>有友军伤害.<br/>"
